Terraform plan for __staging__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_bucket.image_files_bucket will be created
  + resource "google_storage_bucket" "image_files_bucket" {
      + force_destroy               = false
      + id                          = (known after apply)
      + location                    = "ASIA"
      + name                        = "image-files-staging"
      + project                     = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)
    }

  # google_storage_bucket_iam_member.image_file_bucket_sa_role will be created
  + resource "google_storage_bucket_iam_member" "image_file_bucket_sa_role" {
      + bucket = "image-files-staging"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:handler-service@ebo-staging.iam.gserviceaccount.com"
      + role   = "roles/storage.admin"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #489](https://github.com/ebomart/commerce-infrastructure/actions/runs/1981127158)